waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_atim.h
#define    ATIM_CCR5_GC5C3_Pos                                     (31U)
#define    ATIM_CCR5_GC5C3_Msk                                     (0x1UL << ATIM_CCR5_GC5C3_Pos)
#define    ATIM_CCR5_GC5C3                                          ATIM_CCR5_GC5C3_Msk

#define    ATIM_CCR5_GC5C2_Pos                                     (30U)
#define    ATIM_CCR5_GC5C2_Msk                                     (0x1UL << ATIM_CCR5_GC5C2_Pos)
#define    ATIM_CCR5_GC5C2                                         ATIM_CCR5_GC5C2_Msk

#define    ATIM_CCR5_GC5C1_Pos                                     (29U)
#define    ATIM_CCR5_GC5C1_Msk                                     (0x1UL << ATIM_CCR5_GC5C1_Pos)
#define    ATIM_CCR5_GC5C1                                         ATIM_CCR5_GC5C1_Msk

#define    ATIM_ECR_IPOS_Pos                                      (6U)
#define    ATIM_ECR_IPOS_Msk                                      (0x3U << ATIM_ECR_IPOS_Pos)
#define    ATIM_ECR_IPOS                                          ATIM_ECR_IPOS_Msk

#define    ATIM_ECR_FIDX_Pos                                      (5U)
#define    ATIM_ECR_FIDX_Msk                                      (0x1U << ATIM_ECR_FIDX_Pos)
#define    ATIM_ECR_FIDX                                          ATIM_ECR_FIDX_Msk

#define    ATIM_ECR_IDIR_Pos                                      (1U)
#define    ATIM_ECR_IDIR_Msk                                      (0x3U << ATIM_ECR_IDIR_Pos)
#define    ATIM_ECR_IDIR                                          ATIM_ECR_IDIR_Msk

#define    ATIM_ECR_IE_Pos                                        (0U)
#define    ATIM_ECR_IE_Msk                                        (0x1U << ATIM_ECR_IE_Pos)
#define    ATIM_ECR_IE                                            ATIM_ECR_IE_Msk

#define    ATIM_TISEL_TISEL_Pos                                  (0U)
#define    ATIM_TISEL_TISEL_Msk                                  (0xfU << ATIM_TISEL_TISEL_Pos)
#define    ATIM_TISEL_TISEL                                      ATIM_TISEL_TISEL_Msk

#define    ATIM_AFR_ETRSEL_Pos                                    (20U)
#define    ATIM_AFR_ETRSEL_Msk                                    (0xfU << ATIM_AFR_ETRSEL_Pos)
#define    ATIM_AFR_ETRSEL                                        ATIM_AFR_ETRSEL_Msk

#define    ATIM_AFR_OCCLR_SEL_Pos                                 (16U)
#define    ATIM_AFR_OCCLR_SEL_Msk                                 (0x7U << ATIM_AFR_OCCLR_SEL_Pos)
#define    ATIM_AFR_OCCLR_SEL                                     ATIM_AFR_OCCLR_SEL_Msk

#define    ATIM_AFR_BKSYS_E_Pos                                   (8U)
#define    ATIM_AFR_BKSYS_E_Msk                                   (0xfU << ATIM_AFR_BKSYS_E_Pos)
#define    ATIM_AFR_BKSYS_E                                       ATIM_AFR_BKSYS_E_Msk

#define    ATIM_AFR_BKCMP_E_Pos                                   (2U)
#define    ATIM_AFR_BKCMP_E_Msk                                   (0xfU << ATIM_AFR_BKCMP_E_Pos)
#define    ATIM_AFR_BKCMP_E                                       ATIM_AFR_BKCMP_E_Msk

#define    ATIM_AFR_BKIN_E_Pos                                    (0U)
#define    ATIM_AFR_BKIN_E_Msk                                    (0x3U << ATIM_AFR_BKIN_E_Pos)
#define    ATIM_AFR_BKIN_E                                        ATIM_AFR_BKIN_E_Msk

#define    ATIM_BRKFLAG_BKSYS_F_Pos                               (8U)
#define    ATIM_BRKFLAG_BKSYS_F_Msk                               (0xfU << ATIM_BRKFLAG_BKSYS_F_Pos)
#define    ATIM_BRKFLAG_BKSYS_F                                   ATIM_BRKFLAG_BKSYS_F_Msk

#define    ATIM_BRKFLAG_BKCMP_F_Pos                               (2U)
#define    ATIM_BRKFLAG_BKCMP_F_Msk                               (0xfU << ATIM_BRKFLAG_BKCMP_F_Pos)
#define    ATIM_BRKFLAG_BKCMP_F                                    ATIM_BRKFLAG_BKCMP_F_Msk

#define    ATIM_BRKFLAG_BKIN_F_Pos                                (0U)
#define    ATIM_BRKFLAG_BKIN_F_Msk                                (0x3U << ATIM_BRKFLAG_BKIN_F_Pos)
#define    ATIM_BRKFLAG_BKIN_F                                    ATIM_BRKFLAG_BKIN_F_Msk

#define    ATIM_DCR_DBL_Pos                                       (8U)
#define    ATIM_DCR_DBL_Msk                                       (0x1fU << ATIM_DCR_DBL_Pos)
#define    ATIM_DCR_DBL                                           ATIM_DCR_DBL_Msk

#define    ATIM_DCR_DBA_Pos                                       (0U)
#define    ATIM_DCR_DBA_Msk                                       (0x1fU << ATIM_DCR_DBA_Pos)
#define    ATIM_DCR_DBA                                           ATIM_DCR_DBA_Msk

#define    FL_ATIM_CHANNEL_1                                      0x0U
#define    FL_ATIM_CHANNEL_2                                      0x1U
#define    FL_ATIM_CHANNEL_3                                      0x2U
#define    FL_ATIM_CHANNEL_4                                      0x3U
#define    FL_ATIM_CHANNEL_5                                      0x4U
#define    FL_ATIM_CHANNEL_6                                      0x5U

#define    FL_ATIM_TI0                                          0x0U
#define    FL_ATIM_TI1                                          0x1U
#define    FL_ATIM_TI2                                          0x2U
#define    FL_ATIM_TI3                                          0x3U

#define    FL_ATIM_BREAKCHANNEL_0                                 0x0U
#define    FL_ATIM_BREAKCHANNEL_1                                 0x1U

#define    FL_ATIM_CLK_DIVISION_DIV1                              (0x0U << ATIM_CR1_CKD_Pos)
#define    FL_ATIM_CLK_DIVISION_DIV2                              (0x1U << ATIM_CR1_CKD_Pos)
#define    FL_ATIM_CLK_DIVISION_DIV4                              (0x2U << ATIM_CR1_CKD_Pos)

#define    FL_ATIM_COUNTER_ALIGNED_EDGE                           (0x0U << ATIM_CR1_CMS_Pos)
#define    FL_ATIM_COUNTER_ALIGNED_CENTER_DOWN                    (0x1U << ATIM_CR1_CMS_Pos)
#define    FL_ATIM_COUNTER_ALIGNED_CENTER_UP                      (0x2U << ATIM_CR1_CMS_Pos)
#define    FL_ATIM_COUNTER_ALIGNED_CENTER_UP_DOWN                 (0x3U << ATIM_CR1_CMS_Pos)

