waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_atim.h
#define    FL_ATIM_COUNTER_DIR_UP                                 (0x0U << ATIM_CR1_DIR_Pos)
#define    FL_ATIM_COUNTER_DIR_DOWN                               (0x1U << ATIM_CR1_DIR_Pos)

#define    FL_ATIM_ONE_PULSE_MODE_CONTINUOUS                      (0x0U << ATIM_CR1_OPM_Pos)
#define    FL_ATIM_ONE_PULSE_MODE_SINGLE                          (0x1U << ATIM_CR1_OPM_Pos)

#define    FL_ATIM_UPDATE_SOURCE_REGULAR                          (0x0U << ATIM_CR1_URS_Pos)
#define    FL_ATIM_UPDATE_SOURCE_COUNTER                          (0x1U << ATIM_CR1_URS_Pos)

#define    FL_ATIM_TRGO2_UG                                        (0x0U << ATIM_CR2_MMS2_Pos)
#define    FL_ATIM_TRGO2_ENABLE                                    (0x1U << ATIM_CR2_MMS2_Pos)
#define    FL_ATIM_TRGO2_UPDATE                                    (0x2U << ATIM_CR2_MMS2_Pos)
#define    FL_ATIM_TRGO2_CC1IF                                     (0x3U << ATIM_CR2_MMS2_Pos)
#define    FL_ATIM_TRGO2_OC1REF                                    (0x4U << ATIM_CR2_MMS2_Pos)
#define    FL_ATIM_TRGO2_OC2REF                                    (0x5U << ATIM_CR2_MMS2_Pos)
#define    FL_ATIM_TRGO2_OC3REF                                    (0x6U << ATIM_CR2_MMS2_Pos)
#define    FL_ATIM_TRGO2_OC4REF                                    (0x7U << ATIM_CR2_MMS2_Pos)
#define    FL_ATIM_TRGO2_OC5REF                                    (0x8U << ATIM_CR2_MMS2_Pos)
#define    FL_ATIM_TRGO2_OC6REF                                    (0x9U << ATIM_CR2_MMS2_Pos)
#define    FL_ATIM_TRGO2_OC4REF_RISINGFALLING                      (0xaU << ATIM_CR2_MMS2_Pos)
#define    FL_ATIM_TRGO2_OC6REF_RISINGFALLING                      (0xbU << ATIM_CR2_MMS2_Pos)
#define    FL_ATIM_TRGO2_OC4REF_RISING_OC6REF_RISING               (0xcU << ATIM_CR2_MMS2_Pos)
#define    FL_ATIM_TRGO2_OC4REF_RISING_OC6REF_FALLING              (0xdU << ATIM_CR2_MMS2_Pos)
#define    FL_ATIM_TRGO2_OC5REF_RISING_OC6REF_RISING               (0xeU << ATIM_CR2_MMS2_Pos)
#define    FL_ATIM_TRGO2_OC5REF_RISING_OC6REF_FALLING              (0xfU << ATIM_CR2_MMS2_Pos)

#define    FL_ATIM_OCN_IDLE_STATE_LOW                             (0x0U << ATIM_CR2_OISN_Pos)
#define    FL_ATIM_OCN_IDLE_STATE_HIGH                            (0x1U << ATIM_CR2_OISN_Pos)

#define    FL_ATIM_OC_IDLE_STATE_LOW                              (0x0U << ATIM_CR2_OIS_Pos)
#define    FL_ATIM_OC_IDLE_STATE_HIGH                             (0x1U << ATIM_CR2_OIS_Pos)

#define    FL_ATIM_TRGO_RESET                                     (0x0U << ATIM_CR2_MMS_Pos)
#define    FL_ATIM_TRGO_ENABLE                                    (0x1U << ATIM_CR2_MMS_Pos)
#define    FL_ATIM_TRGO_UPDATE                                    (0x2U << ATIM_CR2_MMS_Pos)
#define    FL_ATIM_TRGO_CC1IF                                     (0x3U << ATIM_CR2_MMS_Pos)
#define    FL_ATIM_TRGO_OC1REF                                    (0x4U << ATIM_CR2_MMS_Pos)
#define    FL_ATIM_TRGO_OC2REF                                    (0x5U << ATIM_CR2_MMS_Pos)
#define    FL_ATIM_TRGO_OC3REF                                    (0x6U << ATIM_CR2_MMS_Pos)
#define    FL_ATIM_TRGO_OC4REF                                    (0x7U << ATIM_CR2_MMS_Pos)
#define    FL_ATIM_TRGO_ENCODER                                   (0x200000U << ATIM_CR2_MMS_Pos)
#define    FL_ATIM_TRGO_OCREF1_FALLING                            (0x200001U << ATIM_CR2_MMS_Pos)
#define    FL_ATIM_TRGO_OCREF2_FALLING                            (0x200002U << ATIM_CR2_MMS_Pos)
#define    FL_ATIM_TRGO_OCREF3_FALLING                            (0x200003U << ATIM_CR2_MMS_Pos)
#define    FL_ATIM_TRGO_OCREF4_FALLING                            (0x200004U << ATIM_CR2_MMS_Pos)
#define    FL_ATIM_TRGO_OCREF5_FALLING                            (0x200005U << ATIM_CR2_MMS_Pos)
#define    FL_ATIM_TRGO_OCREF6_FALLING                            (0x200006U << ATIM_CR2_MMS_Pos)
#define    FL_ATIM_TRGO_OC4REF_FALLING_OCREF6_FALLING             (0x200007U << ATIM_CR2_MMS_Pos)

#define    FL_ATIM_CCDMAREQUEST_CC                                (0x0U << ATIM_CR2_CCDS_Pos)
#define    FL_ATIM_CCDMAREQUEST_UPDATE                            (0x1U << ATIM_CR2_CCDS_Pos)

#define    FL_ATIM_CCUPDATESOURCE_COMG_ONLY                       (0x0U << ATIM_CR2_CCUS_Pos)
#define    FL_ATIM_CCUPDATESOURCE_COMG_AND_TRGI                   (0x1U << ATIM_CR2_CCUS_Pos)

#define    FL_ATIM_SMSPS_TIMUPDATE                                (0x0U << ATIM_SMCR_SMSPS_Pos)
#define    FL_ATIM_SMSPS_INDEX                                    (0x1U << ATIM_SMCR_SMSPS_Pos)

#define    FL_ATIM_OCREF_CLR                                      (0x0U << ATIM_SMCR_OCCS_Pos)
#define    FL_ATIM_OCREF_ETRF                                     (0x1U << ATIM_SMCR_OCCS_Pos)

#define    FL_ATIM_ETR_POLARITY_NORMAL                            (0x0U << ATIM_SMCR_ETP_Pos)
#define    FL_ATIM_ETR_POLARITY_INVERT                            (0x1U << ATIM_SMCR_ETP_Pos)

#define    FL_ATIM_ETR_PSC_DIV1                                   (0x0U << ATIM_SMCR_ETPS_Pos)
#define    FL_ATIM_ETR_PSC_DIV2                                   (0x1U << ATIM_SMCR_ETPS_Pos)
#define    FL_ATIM_ETR_PSC_DIV4                                   (0x2U << ATIM_SMCR_ETPS_Pos)
#define    FL_ATIM_ETR_PSC_DIV8                                   (0x3U << ATIM_SMCR_ETPS_Pos)

#define    FL_ATIM_ETR_FILTER_DIV1                                (0x0U << ATIM_SMCR_ETF_Pos)
#define    FL_ATIM_ETR_FILTER_DIV1_N2                             (0x1U << ATIM_SMCR_ETF_Pos)
#define    FL_ATIM_ETR_FILTER_DIV1_N4                             (0x2U << ATIM_SMCR_ETF_Pos)
#define    FL_ATIM_ETR_FILTER_DIV1_N8                             (0x3U << ATIM_SMCR_ETF_Pos)
#define    FL_ATIM_ETR_FILTER_DIV2_N6                             (0x4U << ATIM_SMCR_ETF_Pos)
#define    FL_ATIM_ETR_FILTER_DIV2_N8                             (0x5U << ATIM_SMCR_ETF_Pos)
#define    FL_ATIM_ETR_FILTER_DIV4_N6                             (0x6U << ATIM_SMCR_ETF_Pos)
#define    FL_ATIM_ETR_FILTER_DIV4_N8                             (0x7U << ATIM_SMCR_ETF_Pos)
#define    FL_ATIM_ETR_FILTER_DIV8_N6                             (0x8U << ATIM_SMCR_ETF_Pos)
#define    FL_ATIM_ETR_FILTER_DIV8_N8                             (0x9U << ATIM_SMCR_ETF_Pos)
#define    FL_ATIM_ETR_FILTER_DIV16_N5                            (0xaU << ATIM_SMCR_ETF_Pos)
#define    FL_ATIM_ETR_FILTER_DIV16_N6                            (0xbU << ATIM_SMCR_ETF_Pos)
#define    FL_ATIM_ETR_FILTER_DIV16_N8                            (0xcU << ATIM_SMCR_ETF_Pos)
#define    FL_ATIM_ETR_FILTER_DIV32_N5                            (0xdU << ATIM_SMCR_ETF_Pos)
#define    FL_ATIM_ETR_FILTER_DIV32_N6                            (0xeU << ATIM_SMCR_ETF_Pos)
#define    FL_ATIM_ETR_FILTER_DIV32_N8                            (0xfU << ATIM_SMCR_ETF_Pos)

