waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_atim.h
#define    FL_ATIM_TRGI_ITR0                                      (0x0U << ATIM_SMCR_TS_Pos)
#define    FL_ATIM_TRGI_ITR1                                      (0x1U << ATIM_SMCR_TS_Pos)
#define    FL_ATIM_TRGI_ITR2                                      (0x2U << ATIM_SMCR_TS_Pos)
#define    FL_ATIM_TRGI_ITR3                                      (0x3U << ATIM_SMCR_TS_Pos)
#define    FL_ATIM_TRGI_TI1F_EDGE                                 (0x4U << ATIM_SMCR_TS_Pos)
#define    FL_ATIM_TRGI_TI1FP1                                    (0x5U << ATIM_SMCR_TS_Pos)
#define    FL_ATIM_TRGI_TI2FP2                                    (0x6U << ATIM_SMCR_TS_Pos)
#define    FL_ATIM_TRGI_ETRF                                      (0x7U << ATIM_SMCR_TS_Pos)
#define    FL_ATIM_TRGI_ITR4                                      (0x10000U << ATIM_SMCR_TS_Pos)
#define    FL_ATIM_TRGI_ITR5                                      (0x10001U << ATIM_SMCR_TS_Pos)
#define    FL_ATIM_TRGI_ITR6                                      (0x10002U << ATIM_SMCR_TS_Pos)
#define    FL_ATIM_TRGI_ITR7                                      (0x10003U << ATIM_SMCR_TS_Pos)
#define    FL_ATIM_TRGI_ITR8                                      (0x10004U << ATIM_SMCR_TS_Pos)
#define    FL_ATIM_TRGI_ITR9                                      (0x10005U << ATIM_SMCR_TS_Pos)
#define    FL_ATIM_TRGI_ITR10                                     (0x10006U << ATIM_SMCR_TS_Pos)
#define    FL_ATIM_TRGI_ITR11                                     (0x10007U << ATIM_SMCR_TS_Pos)
#define    FL_ATIM_TRGI_ITR12                                     (0x20000U << ATIM_SMCR_TS_Pos)
#define    FL_ATIM_TRGI_ITR13                                     (0x20001U << ATIM_SMCR_TS_Pos)
#define    FL_ATIM_TRGI_ITR14                                     (0x20002U << ATIM_SMCR_TS_Pos)
#define    FL_ATIM_TRGI_ITR15                                     (0x20003U << ATIM_SMCR_TS_Pos)

#define    FL_ATIM_SLAVE_MODE_PROHIBITED                         (0x0U << ATIM_SMCR_SMS_Pos)
#define    FL_ATIM_SLAVE_MODE_ENCODER_X1_TI1                     (0x1U << ATIM_SMCR_SMS_Pos)
#define    FL_ATIM_SLAVE_MODE_ENCODER_X2_TI2                     (0x2U << ATIM_SMCR_SMS_Pos)
#define    FL_ATIM_SLAVE_MODE_ENCODER_X4_TI1TI2                  (0x3U << ATIM_SMCR_SMS_Pos)
#define    FL_ATIM_SLAVE_MODE_TRGI_RISE_RST                      (0x4U << ATIM_SMCR_SMS_Pos)
#define    FL_ATIM_SLAVE_MODE_TRGI_HIGH_RUN                      (0x5U << ATIM_SMCR_SMS_Pos)
#define    FL_ATIM_SLAVE_MODE_TRGI_RISE_RUN                      (0x6U << ATIM_SMCR_SMS_Pos)
#define    FL_ATIM_SLAVE_MODE_TRGI_CLK                           (0x7U << ATIM_SMCR_SMS_Pos)
#define    FL_ATIM_SLAVE_MODE_TRGI_RISE_RST_RUN                  (0x8U << ATIM_SMCR_SMS_Pos)
#define    FL_ATIM_SLAVE_MODE_TRGI_HIGH_RISE_RUN                 (0x9U << ATIM_SMCR_SMS_Pos)
#define    FL_ATIM_SLAVE_MODE_TRGI_ENCODER_CLK_DIR_X2            (0xaU << ATIM_SMCR_SMS_Pos)
#define    FL_ATIM_SLAVE_MODE_TRGI_ENCODER_CLK_DIR_X1            (0xbU << ATIM_SMCR_SMS_Pos)
#define    FL_ATIM_SLAVE_MODE_TRGI_ENCODER_CLKWithDIR_X2         (0xcU << ATIM_SMCR_SMS_Pos)
#define    FL_ATIM_SLAVE_MODE_TRGI_ENCODER_CLKWithDIR_X1         (0xdU << ATIM_SMCR_SMS_Pos)
#define    FL_ATIM_SLAVE_MODE_QUADRATURE_ENCODER_X1_TI1FP1       (0xeU << ATIM_SMCR_SMS_Pos)
#define    FL_ATIM_SLAVE_MODE_QUADRATURE_ENCODER_X1_TI2FP2       (0xfU << ATIM_SMCR_SMS_Pos)

#define    FL_ATIM_OC_MODE_FROZEN                                 (0x0U << ATIM_CCMR_OCM_Pos)
#define    FL_ATIM_OC_MODE_ACTIVE                                 (0x1U << ATIM_CCMR_OCM_Pos)
#define    FL_ATIM_OC_MODE_INACTIVE                               (0x2U << ATIM_CCMR_OCM_Pos)
#define    FL_ATIM_OC_MODE_TOGGLE                                 (0x3U << ATIM_CCMR_OCM_Pos)
#define    FL_ATIM_OC_MODE_FORCED_INACTIVE                        (0x4U << ATIM_CCMR_OCM_Pos)
#define    FL_ATIM_OC_MODE_FORCED_ACTIVE                          (0x5U << ATIM_CCMR_OCM_Pos)
#define    FL_ATIM_OC_MODE_PWM1                                   (0x6U << ATIM_CCMR_OCM_Pos)
#define    FL_ATIM_OC_MODE_PWM2                                   (0x7U << ATIM_CCMR_OCM_Pos)
#define    FL_ATIM_OC_MODE_RETRIG_OPM1                            (0x1000U << ATIM_CCMR_OCM_Pos)
#define    FL_ATIM_OC_MODE_RETRIG_OPM2                            (0x1001U << ATIM_CCMR_OCM_Pos)
#define    FL_ATIM_OC_MODE_COMBINED_PWM1                          (0x1004U << ATIM_CCMR_OCM_Pos)
#define    FL_ATIM_OC_MODE_COMBINED_PWM2                          (0x1005U << ATIM_CCMR_OCM_Pos)
#define    FL_ATIM_OC_MODE_ASSYMETRIC_PWM1                        (0x1006U << ATIM_CCMR_OCM_Pos)
#define    FL_ATIM_OC_MODE_ASSYMETRIC_PWM2                        (0x1007U << ATIM_CCMR_OCM_Pos)

#define    FL_ATIM_IC_FILTER_DIV1                                 (0x0U << ATIM_CCMR_ICF_Pos)
#define    FL_ATIM_IC_FILTER_DIV1_N2                              (0x1U << ATIM_CCMR_ICF_Pos)
#define    FL_ATIM_IC_FILTER_DIV1_N4                              (0x2U << ATIM_CCMR_ICF_Pos)
#define    FL_ATIM_IC_FILTER_DIV1_N8                              (0x3U << ATIM_CCMR_ICF_Pos)
#define    FL_ATIM_IC_FILTER_DIV2_N6                              (0x4U << ATIM_CCMR_ICF_Pos)
#define    FL_ATIM_IC_FILTER_DIV2_N8                              (0x5U << ATIM_CCMR_ICF_Pos)
#define    FL_ATIM_IC_FILTER_DIV4_N6                              (0x6U << ATIM_CCMR_ICF_Pos)
#define    FL_ATIM_IC_FILTER_DIV4_N8                              (0x7U << ATIM_CCMR_ICF_Pos)
#define    FL_ATIM_IC_FILTER_DIV8_N6                              (0x8U << ATIM_CCMR_ICF_Pos)
#define    FL_ATIM_IC_FILTER_DIV8_N8                              (0x9U << ATIM_CCMR_ICF_Pos)
#define    FL_ATIM_IC_FILTER_DIV16_N5                             (0xaU << ATIM_CCMR_ICF_Pos)
#define    FL_ATIM_IC_FILTER_DIV16_N6                             (0xbU << ATIM_CCMR_ICF_Pos)
#define    FL_ATIM_IC_FILTER_DIV16_N8                             (0xcU << ATIM_CCMR_ICF_Pos)
#define    FL_ATIM_IC_FILTER_DIV32_N5                             (0xdU << ATIM_CCMR_ICF_Pos)
#define    FL_ATIM_IC_FILTER_DIV32_N6                             (0xeU << ATIM_CCMR_ICF_Pos)
#define    FL_ATIM_IC_FILTER_DIV32_N8                             (0xfU << ATIM_CCMR_ICF_Pos)

