waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_atim.h
#define    FL_ATIM_IC_PSC_DIV1                                    (0x0U << ATIM_CCMR_ICPSC_Pos)
#define    FL_ATIM_IC_PSC_DIV2                                    (0x1U << ATIM_CCMR_ICPSC_Pos)
#define    FL_ATIM_IC_PSC_DIV4                                    (0x2U << ATIM_CCMR_ICPSC_Pos)
#define    FL_ATIM_IC_PSC_DIV8                                    (0x3U << ATIM_CCMR_ICPSC_Pos)

#define    FL_ATIM_CHANNEL_MODE_OUTPUT                            (0x0U << ATIM_CCMR_CCS_Pos)
#define    FL_ATIM_CHANNEL_MODE_INPUT_NORMAL                      (0x1U << ATIM_CCMR_CCS_Pos)
#define    FL_ATIM_CHANNEL_MODE_INPUT_CROSSOVER                   (0x2U << ATIM_CCMR_CCS_Pos)
#define    FL_ATIM_CHANNEL_MODE_INPUT_TRC                         (0x3U << ATIM_CCMR_CCS_Pos)

#define    FL_ATIM_OCN_POLARITY_NORMAL                            (0x0U << ATIM_CCER_CCNP_Pos)
#define    FL_ATIM_OCN_POLARITY_INVERT                            (0x1U << ATIM_CCER_CCNP_Pos)

#define    FL_ATIM_OC_POLARITY_NORMAL                             (0x0U << ATIM_CCER_CCOP_Pos)
#define    FL_ATIM_OC_POLARITY_INVERT                             (0x1U << ATIM_CCER_CCOP_Pos)

#define    FL_ATIM_IC_POLARITY_NORMAL                             (0x0U << ATIM_CCER_CCIP_Pos)
#define    FL_ATIM_IC_POLARITY_INVERT                             (0x1U << ATIM_CCER_CCIP_Pos)

#define    FL_ATIM_BREAK2_POLARITY_LOW                             (0x0U << ATIM_BDTR_BK2P_Pos)
#define    FL_ATIM_BREAK2_POLARITY_HIGH                            (0x1U << ATIM_BDTR_BK2P_Pos)

#define    FL_ATIM_BREAK_POLARITY_LOW                             (0x0U << ATIM_BDTR_BKP_Pos)
#define    FL_ATIM_BREAK_POLARITY_HIGH                            (0x1U << ATIM_BDTR_BKP_Pos)

#define    FL_ATIM_OSSR_DISABLE                                   (0x0U << ATIM_BDTR_OSSR_Pos)
#define    FL_ATIM_OSSR_ENABLE                                    (0x1U << ATIM_BDTR_OSSR_Pos)

#define    FL_ATIM_OSSI_DISABLE                                   (0x0U << ATIM_BDTR_OSSI_Pos)
#define    FL_ATIM_OSSI_ENABLE                                    (0x1U << ATIM_BDTR_OSSI_Pos)

#define    FL_ATIM_LOCK_LEVEL_OFF                                 (0x0U << ATIM_BDTR_LOCK_Pos)
#define    FL_ATIM_LOCK_LEVEL_1                                   (0x1U << ATIM_BDTR_LOCK_Pos)
#define    FL_ATIM_LOCK_LEVEL_2                                   (0x2U << ATIM_BDTR_LOCK_Pos)
#define    FL_ATIM_LOCK_LEVEL_3                                   (0x3U << ATIM_BDTR_LOCK_Pos)

#define    FL_ATIM_BREAK_FILTER_DIV1                              (0x0U << ATIM_BDTR_BKF_Pos)
#define    FL_ATIM_BREAK_FILTER_DIV1_N2                           (0x1U << ATIM_BDTR_BKF_Pos)
#define    FL_ATIM_BREAK_FILTER_DIV1_N4                           (0x2U << ATIM_BDTR_BKF_Pos)
#define    FL_ATIM_BREAK_FILTER_DIV1_N8                           (0x3U << ATIM_BDTR_BKF_Pos)
#define    FL_ATIM_BREAK_FILTER_DIV1_N12                           (0x4U << ATIM_BDTR_BKF_Pos)
#define    FL_ATIM_BREAK_FILTER_DIV1_N16                           (0x5U << ATIM_BDTR_BKF_Pos)
#define    FL_ATIM_BREAK_FILTER_DIV1_N24                           (0x6U << ATIM_BDTR_BKF_Pos)
#define    FL_ATIM_BREAK_FILTER_DIV1_N32                           (0x7U << ATIM_BDTR_BKF_Pos)
#define    FL_ATIM_BREAK_FILTER_DIV1_N48                           (0x8U << ATIM_BDTR_BKF_Pos)
#define    FL_ATIM_BREAK_FILTER_DIV1_N64                           (0x9U << ATIM_BDTR_BKF_Pos)
#define    FL_ATIM_BREAK_FILTER_DIV1_N80                          (0xaU << ATIM_BDTR_BKF_Pos)
#define    FL_ATIM_BREAK_FILTER_DIV1_N96                          (0xbU << ATIM_BDTR_BKF_Pos)
#define    FL_ATIM_BREAK_FILTER_DIV1_N128                          (0xcU << ATIM_BDTR_BKF_Pos)
#define    FL_ATIM_BREAK_FILTER_DIV1_N160                          (0xdU << ATIM_BDTR_BKF_Pos)
#define    FL_ATIM_BREAK_FILTER_DIV1_N192                          (0xeU << ATIM_BDTR_BKF_Pos)
#define    FL_ATIM_BREAK_FILTER_DIV1_N256                          (0xfU << ATIM_BDTR_BKF_Pos)

#define    FL_ATIM_INDEX_POSITION_DOWN_DOWN                       (0x0U << ATIM_ECR_IPOS_Pos)
#define    FL_ATIM_INDEX_POSITION_DOWN_UP                         (0x1U << ATIM_ECR_IPOS_Pos)
#define    FL_ATIM_INDEX_POSITION_UP_DOWN                         (0x2U << ATIM_ECR_IPOS_Pos)
#define    FL_ATIM_INDEX_POSITION_UP_UP                           (0x3U << ATIM_ECR_IPOS_Pos)

#define    FL_ATIM_INDEX_FIRST_ONLY                               (0x1U << ATIM_ECR_FIDX_Pos)
#define    FL_ATIM_INDEX_ALL                                      (0x0U << ATIM_ECR_FIDX_Pos)

#define    FL_ATIM_INDEX_UP_DOWN                                  (0x0U << ATIM_ECR_IDIR_Pos)
#define    FL_ATIM_INDEX_UP                                       (0x1U << ATIM_ECR_IDIR_Pos)
#define    FL_ATIM_INDEX_DOWN                                     (0x2U << ATIM_ECR_IDIR_Pos)

#define    FL_ATIM_TIM_CH                                        (0x0U << ATIM_TISEL_TISEL_Pos)
#define    FL_ATIM_TIM_TI_IN1                                    (0x1U << ATIM_TISEL_TISEL_Pos)
#define    FL_ATIM_TIM_TI_IN2                                    (0x2U << ATIM_TISEL_TISEL_Pos)
#define    FL_ATIM_TIM_TI_IN3                                    (0x3U << ATIM_TISEL_TISEL_Pos)
#define    FL_ATIM_TIM_TI_IN4                                    (0x4U << ATIM_TISEL_TISEL_Pos)
#define    FL_ATIM_TIM_TI_IN5                                    (0x5U << ATIM_TISEL_TISEL_Pos)
#define    FL_ATIM_TIM_TI_IN6                                    (0x6U << ATIM_TISEL_TISEL_Pos)
#define    FL_ATIM_TIM_TI_IN7                                    (0x7U << ATIM_TISEL_TISEL_Pos)
#define    FL_ATIM_TIM_TI_IN8                                    (0x8U << ATIM_TISEL_TISEL_Pos)
#define    FL_ATIM_TIM_TI_IN9                                    (0x9U << ATIM_TISEL_TISEL_Pos)
#define    FL_ATIM_TIM_TI_IN10                                   (0xaU << ATIM_TISEL_TISEL_Pos)
#define    FL_ATIM_TIM_TI_IN11                                   (0xbU << ATIM_TISEL_TISEL_Pos)
#define    FL_ATIM_TIM_TI_IN12                                   (0xcU << ATIM_TISEL_TISEL_Pos)
#define    FL_ATIM_TIM_TI_IN13                                   (0xdU << ATIM_TISEL_TISEL_Pos)
#define    FL_ATIM_TIM_TI_IN14                                   (0xeU << ATIM_TISEL_TISEL_Pos)
#define    FL_ATIM_TIM_TI_IN15                                   (0xfU << ATIM_TISEL_TISEL_Pos)

