waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_atim.h
/**
  * @brief    Set break polarity
  * @note     仅仅高级定时器支持
  * @rmtoll   BDTR    BKP    FL_ATIM_SetBreakPolarity
  * @param    TIMx TIM instance
  * @param    polarity This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_BREAK_POLARITY_LOW
  *           @arg @ref FL_ATIM_BREAK_POLARITY_HIGH
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_BREAKCHANNEL_0
  *           @arg @ref FL_ATIM_BREAKCHANNEL_1
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_SetBreakPolarity(ATIM_Type *TIMx,  uint32_t channel, uint32_t polarity)
{
    MODIFY_REG(TIMx->BDTR, ATIM_BDTR_BKP_Msk << (channel * 12), polarity << (channel * 12));
}

/**
  * @brief    Get break polarity
  * @note     仅仅高级定时器支持
  * @rmtoll   BDTR    BKP    FL_ATIM_GetBreakPolarity
  * @param    TIMx TIM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_BREAKCHANNEL_0
  *           @arg @ref FL_ATIM_BREAKCHANNEL_1
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ATIM_BREAK_POLARITY_LOW
  *           @arg @ref FL_ATIM_BREAK_POLARITY_HIGH
  */
__STATIC_INLINE uint32_t FL_ATIM_GetBreakPolarity(ATIM_Type *TIMx, uint32_t channel)
{
    return (uint32_t)(READ_BIT(TIMx->BDTR, ATIM_BDTR_BKP_Msk << (channel * 12)));
}

/**
  * @brief    Break enable
  * @note     仅仅高级定时器支持
  * @rmtoll   BDTR    BKE    FL_ATIM_EnableBreak
  * @param    TIMx TIM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_BREAKCHANNEL_0
  *           @arg @ref FL_ATIM_BREAKCHANNEL_1
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_EnableBreak(ATIM_Type *TIMx, uint32_t channel)
{
    SET_BIT(TIMx->BDTR, ATIM_BDTR_BKE_Msk << (channel * 12));
}

/**
  * @brief    Get break enable status
  * @note     仅仅高级定时器支持
  * @rmtoll   BDTR    BKE    FL_ATIM_IsEnabledBreak
  * @param    TIMx TIM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_BREAKCHANNEL_0
  *           @arg @ref FL_ATIM_BREAKCHANNEL_1
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ATIM_IsEnabledBreak(ATIM_Type *TIMx, uint32_t channel)
{
    return (uint32_t)(READ_BIT(TIMx->BDTR, ATIM_BDTR_BKE_Msk << (channel * 12)) == ATIM_BDTR_BKE_Msk << (channel * 12));
}

/**
  * @brief    Break disable
  * @note     仅仅高级定时器支持
  * @rmtoll   BDTR    BKE    FL_ATIM_DisableBreak
  * @param    TIMx TIM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_BREAKCHANNEL_0
  *           @arg @ref FL_ATIM_BREAKCHANNEL_1
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_DisableBreak(ATIM_Type *TIMx, uint32_t channel)
{
    CLEAR_BIT(TIMx->BDTR, ATIM_BDTR_BKE_Msk << (channel * 12));
}

/**
  * @brief    Off-State Select in Run mode
  * @note     仅仅高级定时器支持
  * @rmtoll   BDTR    OSSR    FL_ATIM_SetOffStateRun
  * @param    TIMx TIM instance
  * @param    state This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_OSSR_DISABLE
  *           @arg @ref FL_ATIM_OSSR_ENABLE
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_SetOffStateRun(ATIM_Type *TIMx, uint32_t state)
{
    MODIFY_REG(TIMx->BDTR, ATIM_BDTR_OSSR_Msk, state);
}

/**
  * @brief    Get Off-State Select in Run mode
  * @note     仅仅高级定时器支持
  * @rmtoll   BDTR    OSSR    FL_ATIM_GetOffStateRun
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ATIM_OSSR_DISABLE
  *           @arg @ref FL_ATIM_OSSR_ENABLE
  */
__STATIC_INLINE uint32_t FL_ATIM_GetOffStateRun(ATIM_Type *TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->BDTR, ATIM_BDTR_OSSR_Msk));
}

/**
  * @brief    Off-State Select in IDLE mode
  * @note     仅仅高级定时器支持
  * @rmtoll   BDTR    OSSI    FL_ATIM_SetOffStateIdle
  * @param    TIMx TIM instance
  * @param    state This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_OSSI_DISABLE
  *           @arg @ref FL_ATIM_OSSI_ENABLE
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_SetOffStateIdle(ATIM_Type *TIMx, uint32_t state)
{
    MODIFY_REG(TIMx->BDTR, ATIM_BDTR_OSSI_Msk, state);
}

/**
  * @brief     Set Off-State Select in IDLE mode
  * @note     仅仅高级定时器支持
  * @rmtoll   BDTR    OSSI    FL_ATIM_GetOffStateIdle
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ATIM_OSSI_DISABLE
  *           @arg @ref FL_ATIM_OSSI_ENABLE
  */
__STATIC_INLINE uint32_t FL_ATIM_GetOffStateIdle(ATIM_Type *TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->BDTR, ATIM_BDTR_OSSI_Msk));
}

/**
  * @brief    Set register write LOCK level
  * @note     仅仅高级定时器支持
  * @rmtoll   BDTR    LOCK    FL_ATIM_SetLockLevel
  * @param    TIMx TIM instance
  * @param    lockLevel This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_LOCK_LEVEL_OFF
  *           @arg @ref FL_ATIM_LOCK_LEVEL_1
  *           @arg @ref FL_ATIM_LOCK_LEVEL_2
  *           @arg @ref FL_ATIM_LOCK_LEVEL_3
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_SetLockLevel(ATIM_Type *TIMx, uint32_t lockLevel)
{
    MODIFY_REG(TIMx->BDTR, ATIM_BDTR_LOCK_Msk, lockLevel);
}

/**
  * @brief    Get register write LOCK status
  * @note     仅仅高级定时器支持
  * @rmtoll   BDTR    LOCK    FL_ATIM_GetLockLevel
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ATIM_LOCK_LEVEL_OFF
  *           @arg @ref FL_ATIM_LOCK_LEVEL_1
  *           @arg @ref FL_ATIM_LOCK_LEVEL_2
  *           @arg @ref FL_ATIM_LOCK_LEVEL_3
  */
__STATIC_INLINE uint32_t FL_ATIM_GetLockLevel(ATIM_Type *TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->BDTR, ATIM_BDTR_LOCK_Msk));
}

/**
  * @brief    Set dead time generation length
  * @note     仅仅高级定时器支持
  * @rmtoll   BDTR    DTG    FL_ATIM_WriteDeadTime
  * @param    TIMx TIM instance
  * @param    deadTime
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_WriteDeadTime(ATIM_Type *TIMx, uint32_t deadTime)
{
    MODIFY_REG(TIMx->BDTR, (0xffU << 0U), (deadTime << 0U));
}

/**
  * @brief    Get dead time generation length
  * @note     仅仅高级定时器支持
  * @rmtoll   BDTR    DTG    FL_ATIM_ReadDeadTime
  * @param    TIMx TIM instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_ATIM_ReadDeadTime(ATIM_Type *TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->BDTR, (0xffU << 0U)) >> 0U);
}

/**
  * @brief    Set brake signal filter clock and length selection
  * @note     仅仅高级定时器支持
  * @rmtoll   BDTR    BKF    FL_ATIM_SetBreakFilter
  * @param    TIMx TIM instance
  * @param    filter This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_BREAK_FILTER_DIV1
  *           @arg @ref FL_ATIM_BREAK_FILTER_DIV1_N2
  *           @arg @ref FL_ATIM_BREAK_FILTER_DIV1_N4
  *           @arg @ref FL_ATIM_BREAK_FILTER_DIV1_N8
  *           @arg @ref FL_ATIM_BREAK_FILTER_DIV2_N6
  *           @arg @ref FL_ATIM_BREAK_FILTER_DIV2_N8
  *           @arg @ref FL_ATIM_BREAK_FILTER_DIV4_N6
  *           @arg @ref FL_ATIM_BREAK_FILTER_DIV4_N8
  *           @arg @ref FL_ATIM_BREAK_FILTER_DIV8_N6
  *           @arg @ref FL_ATIM_BREAK_FILTER_DIV8_N8
  *           @arg @ref FL_ATIM_BREAK_FILTER_DIV16_N5
  *           @arg @ref FL_ATIM_BREAK_FILTER_DIV16_N6
  *           @arg @ref FL_ATIM_BREAK_FILTER_DIV16_N8
  *           @arg @ref FL_ATIM_BREAK_FILTER_DIV32_N5
  *           @arg @ref FL_ATIM_BREAK_FILTER_DIV32_N6
  *           @arg @ref FL_ATIM_BREAK_FILTER_DIV32_N8
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_BREAKCHANNEL_0
  *           @arg @ref FL_ATIM_BREAKCHANNEL_1
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_SetBreakFilter(ATIM_Type *TIMx, uint32_t channel, uint32_t filter)
{
    MODIFY_REG(TIMx->BDTR, ATIM_BDTR_BKF_Msk << (channel * 4), filter << (channel * 4));
}

/**
  * @brief    Get brake signal filter clock and length selection
  * @note     仅仅高级定时器支持
  * @rmtoll   BDTR    BKF    FL_ATIM_GetBreakFilter
  * @param    TIMx TIM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_BREAKCHANNEL_0
  *           @arg @ref FL_ATIM_BREAKCHANNEL_1
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ATIM_BREAK_FILTER_DIV1
  *           @arg @ref FL_ATIM_BREAK_FILTER_DIV1_N2
  *           @arg @ref FL_ATIM_BREAK_FILTER_DIV1_N4
  *           @arg @ref FL_ATIM_BREAK_FILTER_DIV1_N8
  *           @arg @ref FL_ATIM_BREAK_FILTER_DIV2_N6
  *           @arg @ref FL_ATIM_BREAK_FILTER_DIV2_N8
  *           @arg @ref FL_ATIM_BREAK_FILTER_DIV4_N6
  *           @arg @ref FL_ATIM_BREAK_FILTER_DIV4_N8
  *           @arg @ref FL_ATIM_BREAK_FILTER_DIV8_N6
  *           @arg @ref FL_ATIM_BREAK_FILTER_DIV8_N8
  *           @arg @ref FL_ATIM_BREAK_FILTER_DIV16_N5
  *           @arg @ref FL_ATIM_BREAK_FILTER_DIV16_N6
  *           @arg @ref FL_ATIM_BREAK_FILTER_DIV16_N8
  *           @arg @ref FL_ATIM_BREAK_FILTER_DIV32_N5
  *           @arg @ref FL_ATIM_BREAK_FILTER_DIV32_N6
  *           @arg @ref FL_ATIM_BREAK_FILTER_DIV32_N8
  */
__STATIC_INLINE uint32_t FL_ATIM_GetBreakFilter(ATIM_Type *TIMx, uint32_t channel)
{
    return (uint32_t)(READ_BIT(TIMx->BDTR, ATIM_BDTR_BKF_Msk << (channel * 4)));
}

/**
  * @brief    Set index positioning
  * @note     仅仅高级定时器支持
  * @rmtoll   ECR    IPOS    FL_ATIM_SetIndexPositionning
  * @param    TIMx TIM instance
  * @param    IndexPositionning This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_INDEX_POSITION_DOWN_DOWN
  *           @arg @ref FL_ATIM_INDEX_POSITION_DOWN_UP
  *           @arg @ref FL_ATIM_INDEX_POSITION_UP_DOWN
  *           @arg @ref FL_ATIM_INDEX_POSITION_UP_UP
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_SetIndexPositionning(ATIM_Type *TIMx, uint32_t IndexPositionning)
{
    MODIFY_REG(TIMx->ECR, ATIM_ECR_IPOS_Msk, IndexPositionning);
}

/**
  * @brief    Get actual index positioning
  * @note     仅仅高级定时器支持
  * @rmtoll   ECR    IPOS    FL_ATIM_GetIndexPositionning
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ATIM_INDEX_POSITION_DOWN_DOWN
  *           @arg @ref FL_ATIM_INDEX_POSITION_DOWN_UP
  *           @arg @ref FL_ATIM_INDEX_POSITION_UP_DOWN
  *           @arg @ref FL_ATIM_INDEX_POSITION_UP_UP
  */
__STATIC_INLINE uint32_t FL_ATIM_GetIndexPositionning(ATIM_Type *TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->ECR, ATIM_ECR_IPOS_Msk));
}

/**
  * @brief
  * @note     仅仅高级定时器支持
  * @rmtoll   ECR    FIDX    FL_ATIM_SetIDXMode
  * @param    TIMx TIM instance
  * @param    IDXmode This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_INDEX_FIRST_ONLY
  *           @arg @ref FL_ATIM_INDEX_ALL
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_SetIDXMode(ATIM_Type *TIMx, uint32_t IDXmode)
{
    MODIFY_REG(TIMx->ECR, ATIM_ECR_FIDX_Msk, IDXmode);
}

/**
  * @brief
  * @note     仅仅高级定时器支持
  * @rmtoll   ECR    FIDX    FL_ATIM_GetIDXMode
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ATIM_INDEX_FIRST_ONLY
  *           @arg @ref FL_ATIM_INDEX_ALL
  */
__STATIC_INLINE uint32_t FL_ATIM_GetIDXMode(ATIM_Type *TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->ECR, ATIM_ECR_FIDX_Msk));
}

/**
  * @brief
  * @note     仅仅高级定时器支持
  * @rmtoll   ECR    IDIR    FL_ATIM_SetIDXDirection
  * @param    TIMx TIM instance
  * @param    IDXdirection This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_INDEX_UP_DOWN
  *           @arg @ref FL_ATIM_INDEX_UP
  *           @arg @ref FL_ATIM_INDEX_DOWN
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_SetIDXDirection(ATIM_Type *TIMx, uint32_t IDXdirection)
{
    MODIFY_REG(TIMx->ECR, ATIM_ECR_IDIR_Msk, IDXdirection);
}

/**
  * @brief
  * @note     仅仅高级定时器支持
  * @rmtoll   ECR    IDIR    FL_ATIM_GetIDXDirection
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ATIM_INDEX_UP_DOWN
  *           @arg @ref FL_ATIM_INDEX_UP
  *           @arg @ref FL_ATIM_INDEX_DOWN
  */
__STATIC_INLINE uint32_t FL_ATIM_GetIDXDirection(ATIM_Type *TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->ECR, ATIM_ECR_IDIR_Msk));
}

/**
  * @brief    Break enable
  * @note     仅仅高级定时器支持
  * @rmtoll   ECR    IE    FL_ATIM_EnableIDX
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_EnableIDX(ATIM_Type *TIMx)
{
    SET_BIT(TIMx->ECR, ATIM_ECR_IE_Msk);
}

/**
  * @brief    Get break enable status
  * @note     仅仅高级定时器支持
  * @rmtoll   ECR    IE    FL_ATIM_IsEnabledIDX
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ATIM_IsEnabledIDX(ATIM_Type *TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->ECR, ATIM_ECR_IE_Msk) == ATIM_ECR_IE_Msk);
}

/**
  * @brief    Break disable
  * @note     仅仅高级定时器支持
  * @rmtoll   ECR    IE    FL_ATIM_DisableIDX
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_DisableIDX(ATIM_Type *TIMx)
{
    CLEAR_BIT(TIMx->ECR, ATIM_ECR_IE_Msk);
}

/**
  * @brief
  * @rmtoll   TISEL    TISEL    FL_GPTIM_SetTISource
  * @param    TIMx TIM instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_TIM_TI_IN0
  *           @arg @ref FL_ATIM_TIM_TI_IN1
  *           @arg @ref FL_ATIM_TIM_TI_IN2
  *           @arg @ref FL_ATIM_TIM_TI_IN3
  *           @arg @ref FL_ATIM_TIM_TI_IN4
  *           @arg @ref FL_ATIM_TIM_TI_IN5
  *           @arg @ref FL_ATIM_TIM_TI_IN6
  *           @arg @ref FL_ATIM_TIM_TI_IN7
  *           @arg @ref FL_ATIM_TIM_TI_IN8
  *           @arg @ref FL_ATIM_TIM_TI_IN9
  *           @arg @ref FL_ATIM_TIM_TI_IN10
  *           @arg @ref FL_ATIM_TIM_TI_IN11
  *           @arg @ref FL_ATIM_TIM_TI_IN12
  *           @arg @ref FL_ATIM_TIM_TI_IN13
  *           @arg @ref FL_ATIM_TIM_TI_IN14
  *           @arg @ref FL_ATIM_TIM_TI_IN15
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_TI0
  *           @arg @ref FL_ATIM_TI1
  *           @arg @ref FL_ATIM_TI2
  *           @arg @ref FL_ATIM_TI3
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_SetTISource(ATIM_Type *TIMx, uint32_t source, uint32_t channel)
{
    switch(channel)
    {
        case FL_ATIM_TI0:
            MODIFY_REG(TIMx->TISEL, (0xFU << 0U), (source));
            break;
        case FL_ATIM_TI1:
            MODIFY_REG(TIMx->TISEL, (0xFU << 8U), (source << 8U));
            break;
        case FL_ATIM_TI2:
            MODIFY_REG(TIMx->TISEL, (0xFU << 16U), (source << 16U));
            break;
        case FL_ATIM_TI3:
            MODIFY_REG(TIMx->TISEL, (0xFU << 24U), (source << 24U));
            break;
    }
}

/**
  * @brief
  * @rmtoll   TISEL    TISEL    FL_GPTIM_GetTISource
  * @param    TIMx TIM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_TI0
  *           @arg @ref FL_ATIM_TI1
  *           @arg @ref FL_ATIM_TI2
  *           @arg @ref FL_ATIM_TI3
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ATIM_TIM_TI_IN0
  *           @arg @ref FL_ATIM_TIM_TI_IN1
  *           @arg @ref FL_ATIM_TIM_TI_IN2
  *           @arg @ref FL_ATIM_TIM_TI_IN3
  *           @arg @ref FL_ATIM_TIM_TI_IN4
  *           @arg @ref FL_ATIM_TIM_TI_IN5
  *           @arg @ref FL_ATIM_TIM_TI_IN6
  *           @arg @ref FL_ATIM_TIM_TI_IN7
  *           @arg @ref FL_ATIM_TIM_TI_IN8
  *           @arg @ref FL_ATIM_TIM_TI_IN9
  *           @arg @ref FL_ATIM_TIM_TI_IN10
  *           @arg @ref FL_ATIM_TIM_TI_IN11
  *           @arg @ref FL_ATIM_TIM_TI_IN12
  *           @arg @ref FL_ATIM_TIM_TI_IN13
  *           @arg @ref FL_ATIM_TIM_TI_IN14
  *           @arg @ref FL_ATIM_TIM_TI_IN15
  */
__STATIC_INLINE uint32_t FL_ATIM_GetTISource(ATIM_Type *TIMx, uint32_t channel)
{
    switch(channel)
    {
        case FL_ATIM_TI0:
            return (uint32_t)(READ_BIT(TIMx->TISEL, (0xFU << 0U)) >> 0U);
        case FL_ATIM_TI1:
            return (uint32_t)(READ_BIT(TIMx->TISEL, (0xFU << 8U)) >> 8U);
        case FL_ATIM_TI2:
            return (uint32_t)(READ_BIT(TIMx->TISEL, (0xFU << 16U)) >> 16U);
        case FL_ATIM_TI3:
            return (uint32_t)(READ_BIT(TIMx->TISEL, (0xFU << 24U)) >> 24U);
        default:
            return 0;
    }
}

/**
  * @brief
  * @note     仅仅高级定时器支持
  * @rmtoll   AFR    ETRSEL    FL_ATIM_SetETRSource
  * @param    TIMx TIM instance
  * @param    ETRsource This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_TIM_ETR_IN0
  *           @arg @ref FL_ATIM_TIM_ETR_IN1
  *           @arg @ref FL_ATIM_TIM_ETR_IN2
  *           @arg @ref FL_ATIM_TIM_ETR_IN3
  *           @arg @ref FL_ATIM_TIM_ETR_IN4
  *           @arg @ref FL_ATIM_TIM_ETR_IN5
  *           @arg @ref FL_ATIM_TIM_ETR_IN6
  *           @arg @ref FL_ATIM_TIM_ETR_IN7
  *           @arg @ref FL_ATIM_TIM_ETR_IN8
  *           @arg @ref FL_ATIM_TIM_ETR_IN9
  *           @arg @ref FL_ATIM_TIM_ETR_IN10
  *           @arg @ref FL_ATIM_TIM_ETR_IN11
  *           @arg @ref FL_ATIM_TIM_ETR_IN12
  *           @arg @ref FL_ATIM_TIM_ETR_IN13
  *           @arg @ref FL_ATIM_TIM_ETR_IN14
  *           @arg @ref FL_ATIM_TIM_ETR_IN15
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_SetETRSource(ATIM_Type *TIMx, uint32_t ETRsource)
{
    MODIFY_REG(TIMx->AFR, ATIM_AFR_ETRSEL_Msk, ETRsource);
}

/**
  * @brief
  * @note     仅仅高级定时器支持
  * @rmtoll   AFR    ETRSEL    FL_ATIM_GetETRSource
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ATIM_TIM_ETR_IN0
  *           @arg @ref FL_ATIM_TIM_ETR_IN1
  *           @arg @ref FL_ATIM_TIM_ETR_IN2
  *           @arg @ref FL_ATIM_TIM_ETR_IN3
  *           @arg @ref FL_ATIM_TIM_ETR_IN4
  *           @arg @ref FL_ATIM_TIM_ETR_IN5
  *           @arg @ref FL_ATIM_TIM_ETR_IN6
  *           @arg @ref FL_ATIM_TIM_ETR_IN7
  *           @arg @ref FL_ATIM_TIM_ETR_IN8
  *           @arg @ref FL_ATIM_TIM_ETR_IN9
  *           @arg @ref FL_ATIM_TIM_ETR_IN10
  *           @arg @ref FL_ATIM_TIM_ETR_IN11
  *           @arg @ref FL_ATIM_TIM_ETR_IN12
  *           @arg @ref FL_ATIM_TIM_ETR_IN13
  *           @arg @ref FL_ATIM_TIM_ETR_IN14
  *           @arg @ref FL_ATIM_TIM_ETR_IN15
  */
__STATIC_INLINE uint32_t FL_ATIM_GetETRSource(ATIM_Type *TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->AFR, ATIM_AFR_ETRSEL_Msk));
}

/**
  * @brief
  * @note     仅仅高级定时器支持
  * @rmtoll   AFR    OCCLR_SEL    FL_ATIM_SetOCRefClearSource
  * @param    TIMx TIM instance
  * @param    OCrefsource This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_OCREF_CLRSOURCE_COMP1
  *           @arg @ref FL_ATIM_OCREF_CLRSOURCE_COMP2
  *           @arg @ref FL_ATIM_OCREF_CLRSOURCE_COMP3
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_SetOCRefClearSource(ATIM_Type *TIMx, uint32_t OCrefsource)
{
    MODIFY_REG(TIMx->AFR, ATIM_AFR_OCCLR_SEL_Msk, OCrefsource);
}

/**
  * @brief
  * @note     仅仅高级定时器支持
  * @rmtoll   AFR    OCCLR_SEL    FL_ATIM_GetOCRefClearSource
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ATIM_OCREF_CLRSOURCE_COMP1
  *           @arg @ref FL_ATIM_OCREF_CLRSOURCE_COMP2
  *           @arg @ref FL_ATIM_OCREF_CLRSOURCE_COMP3
  */
__STATIC_INLINE uint32_t FL_ATIM_GetOCRefClearSource(ATIM_Type *TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->AFR, ATIM_AFR_OCCLR_SEL_Msk));
}

/**
  * @brief
  * @note     仅仅高级定时器支持
  * @rmtoll   AFR    BKIN1E    FL_ATIM_SetBreakInput
  * @param    TIMx TIM instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_BKIN_SOURCE_GPIO1
  *           @arg @ref FL_ATIM_BKIN_SOURCE_GPIO2
  *           @arg @ref FL_ATIM_BKIN_SOURCE_COMP1
  *           @arg @ref FL_ATIM_BKIN_SOURCE_COMP2
  *           @arg @ref FL_ATIM_BKIN_SOURCE_COMP3
  *           @arg @ref FL_ATIM_BKIN_SOURCE_COMP4
  *           @arg @ref FL_ATIM_BKIN_SOURCE_HFDET
  *           @arg @ref FL_ATIM_BKIN_SOURCE_SVD
  *           @arg @ref FL_ATIM_BKIN_SOURCE_LOCKUP
  *           @arg @ref FL_ATIM_BKIN_SOURCE_RAMPARITY
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_SetBreakInput(ATIM_Type *TIMx, uint32_t BRKsource)
{
    MODIFY_REG(TIMx->AFR, ATIM_AFR_BKIN_E_Msk | ATIM_AFR_BKCMP_E_Msk | ATIM_AFR_BKSYS_E_Msk, BRKsource);
}

/**
  * @brief
  * @note     仅仅高级定时器支持
  * @rmtoll   AFR    BKSYS3E    FL_ATIM_GetBreakInput
  * @param    TIMx TIM instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_BKIN_SOURCE_GPIO1
  *           @arg @ref FL_ATIM_BKIN_SOURCE_GPIO2
  *           @arg @ref FL_ATIM_BKIN_SOURCE_COMP1
  *           @arg @ref FL_ATIM_BKIN_SOURCE_COMP2
  *           @arg @ref FL_ATIM_BKIN_SOURCE_COMP3
  *           @arg @ref FL_ATIM_BKIN_SOURCE_COMP4
  *           @arg @ref FL_ATIM_BKIN_SOURCE_HFDET
  *           @arg @ref FL_ATIM_BKIN_SOURCE_SVD
  *           @arg @ref FL_ATIM_BKIN_SOURCE_LOCKUP
  *           @arg @ref FL_ATIM_BKIN_SOURCE_RAMPARITY
  * @retval   None
  */
__STATIC_INLINE uint32_t FL_ATIM_GetBreakInput(ATIM_Type *TIMx, uint32_t BRKsource)
{
    return (uint32_t)(READ_BIT(TIMx->AFR, 0xfff << 0));
}

/**
  * @}
  */

/** @defgroup ATIM_FL_EF_Init Initialization and de-initialization functions
  * @{
  */
FL_ErrorStatus FL_ATIM_Init(ATIM_Type *TIMx, FL_ATIM_InitTypeDef *TIM_InitStruct);
FL_ErrorStatus FL_ATIM_SlaveMode_Init(ATIM_Type *TIMx, FL_ATIM_SlaveInitTypeDef *TIM_InitStruct);
FL_ErrorStatus  FL_ATIM_IC_Init(ATIM_Type *TIMx, uint32_t channel, FL_ATIM_IC_InitTypeDef *IC_InitStruct);
FL_ErrorStatus  FL_ATIM_ETR_Init(ATIM_Type *TIMx, FL_ATIM_ETR_InitTypeDef *TIM_InitStruct);
FL_ErrorStatus FL_ATIM_OC_Init(ATIM_Type *TIMx, uint32_t channel, FL_ATIM_OC_InitTypeDef *TIM_OC_InitStruct);
FL_ErrorStatus FL_ATIM_BDTR_Init(ATIM_Type *TIMx, uint32_t channel, FL_ATIM_BDTR_InitTypeDef *TIM_BDTR_InitStruct);

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33FK5XX_FL_ATIM_H*/

/*************************Py_Code_Generator Version: 0.1-0.14-0.1 @ 2023-05-18*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
